
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Добавляем элемент Контактное лицо  
	НовыйЭлемент = Элементы.Добавить("КонтактноеЛицо",Тип("ПолеФормы"),Элементы.ГруппаШапкаПраво);
	НовыйЭлемент.ПутьКДанным    = "Объект.КонтактноеЛицо";
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода; 	
	
	//Добавляем новую группу и в нее реквизиты формы: Согласованная скидка и Команда "Перерасчет"
	
	НоваяГруппаФормы = Элементы.Добавить("ГруппаСкидкаИПересчет",Тип("ГруппаФормы"),Элементы.ГруппаШапкаЛево);
	НоваяГруппаФормы.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаФормы.Отображение         = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппаФормы.ОтображатьЗаголовок = Ложь;
	НоваяГруппаФормы.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	НовыйЭлемент = Элементы.Добавить("СогласованнаяСкидка",Тип("ПолеФормы"),НоваяГруппаФормы);
	НовыйЭлемент.ПутьКДанным    = "Объект.СогласованнаяСкидка";
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.КнопкаОчистки = Истина; 
	НовыйЭлемент.КнопкаВыбора = Истина;
	НовыйЭлемент.УстановитьДействие("ПриИзменении","СогласованнаяСкидкаПриИзменении");
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("Перерасчет");  
	НоваяКоманда.Действие = "Перерасчет" ; 
	НоваяКнопка = Элементы.Добавить("Перерасчет", Тип("КнопкаФормы"), НоваяГруппаФормы) ; 
	
	НоваяКнопка.ИмяКоманды = "Перерасчет"; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
	// Добавляем код изменения при расчете 
	
	
	Если  ПревышениеСовместнойСкидкиБолее100Процентов(Объект.СогласованнаяСкидка,ТекущиеДанные.Скидка,ТекущиеДанные.НомерСтроки) Тогда
		
		ТекущиеДанные.Сумма = 0; 
		
	иначе  
		
		ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество*(1 - (Объект.СогласованнаяСкидка+ТекущиеДанные.Скидка)/100);
		
	КонецЕсли;
	
	РассчитатьСуммуДокумента();    
	
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте

Функция ПревышениеСовместнойСкидкиБолее100Процентов(СогласованнаяСкидка,СкидкаПостроке,НомерСтроки)
	
	Более100Процентов = (СогласованнаяСкидка+СкидкаПостроке) >100;
	
	Если Более100Процентов Тогда
	
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "Скидка более 100 процентов установлена сумма по строке " +НомерСтроки+" в  0!!!";
		 Сообщение.Сообщить();
	     Возврат Истина;  
		 
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции 

&НаКлиенте

Процедура Перерасчет(Команда)
	
	ПерерасчетТабЧастиПоСкидке(Объект.Товары);
	ПерерасчетТабЧастиПоСкидке(Объект.Услуги);
	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПерерасчетТабЧастиПоСкидке(ТабличнаяЧасть)
	
	Перем СтрокаТаблицы;
	
	Для каждого СтрокаТаблицы Из  ТабличнаяЧасть Цикл
		
		РассчитатьСуммуСтроки(СтрокаТаблицы);
		
	КонецЦикла;	
	
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СогласованнаяСкидкаПриИзменении(Элемент)
	ТекстВопроса = "Пересчитать согласно скидки табличную часть документа?"; 
	
	Обещание = ждать ВопросАсинх(ТекстВопроса,РежимДиалогаВопрос.ДаНет); 
	
	Если  Обещание = КодВозвратаДиалога.Нет Тогда
		возврат;
	КонецЕсли;
	
	ПерерасчетТабЧастиПоСкидке(Объект.Товары);
	ПерерасчетТабЧастиПоСкидке(Объект.Услуги);
	
КонецПроцедуры


#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
